3_Solver/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; // dimensions are m/s

internalField   uniform (0 5 0);

boundaryField
{

    Inlet
    {
        type                fixedValue;
        // volumetricFlowRate  0.04167;
        value               uniform (0 5 0); // A = pi e-4 m2, V = 5m/s , Q = 5pi e-4 m3/h
        // extrapolateProfile  no;
    }
    
    Outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
    }

    Wall
    {
        type            noSlip;
    }

}

// ************************************************************************* //
