3_Solver/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.09375; // U = 5 m/s ,T_u = 5% , Eddy viscosity ratio = 10

boundaryField
{

    Inlet
    {
        type            fixedValue;
        value           uniform 0.09375;
    }
    
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.09375;
    }

    Wall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
