3_Solver/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0]; // kinematic pressure

internalField   uniform 101.6298; //setting the kinematic pressure

boundaryField
{

    Inlet
    {
        type            zeroGradient;
    }
    
    Outlet
    {
        type            fixedValue;
        value           uniform 101.6298;   // p/ro = 1[atm]/1000[kg/m^3] = 101.6298 [m^2/s^2]
    }

    Wall
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
