3_Solver/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
 = ========                 |                                                  *
 \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \\    /   O peration     | Website:  https://openfoam.org
 \\  /    A nd           | Version:  12
 \\/     M anipulation  |
 \*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// *                  ** //
ddtSchemes
{
    default         steadyState;
}
gradSchemes
{
    default         cellLimited Gauss linear 0.5;
    grad(U)         cellLimited Gauss linear 1;
}
divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwind grad(U);  // Added this line
    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;  // Changed Urel to U
}
laplacianSchemes
{
    default         Gauss linear limited 0.5;
}
interpolationSchemes
{
    default         linear;
}
snGradSchemes
{
    default         limited 0.5;
}
wallDist
{
    method meshWave;
}
// ************************************************************************* //
